tarot_readers = {
    "Feline" : {"Name" : "Fortune Feline",
                "Bio" : "A cool cat, with magical luck",
                "Model" : "gemini-3.1-flash-lite"},
    "Professor" : {"Name" : "Professor Arcana",
                   "Bio" : "A wise old-school teacher, who knows all the mysteries",
                   "Model" : "gemini-2.5-flash"},
    "Madame" : {"Name" : "Madame Shuffle",
                "Bio" : "A very intelligent and cunning witch, always ready to cut the deck",
                "Model" : "gemini-3.5-flash"},
    "Crystal" : {"Name" : "Crystal Cardwell",
                 "Bio" : "A very experienced tarot reader, sees your future in the cards and the stars",
                 "Model" : "gemini-2.5-flash-lite"}
}

logo ="""
░█▄█░█▀█░█▀▀░▀█▀░█▀▀░█░░░▀█▀░░░░░▀█▀░█▀█░█▀▄░█▀█░▀█▀
░█░█░█▀█░█░█░░█░░█░░░█░░░░█░░░░░░░█░░█▀█░█▀▄░█░█░░█░
░▀░▀░▀░▀░▀▀▀░▀▀▀░▀▀▀░▀▀▀░▀▀▀░▀▀▀░░▀░░▀░▀░▀░▀░▀▀▀░░▀░
"""

file_logo ="""
░█▄█░█▀█░█▀▀░▀█▀░█▀▀░█░░░▀█▀░░░░░▀█▀░█▀█░█▀▄░█▀█░▀█▀ \\
░█░█░█▀█░█░█░░█░░█░░░█░░░░█░░░░░░░█░░█▀█░█▀▄░█░█░░█░ \\
░▀░▀░▀░▀░▀▀▀░▀▀▀░▀▀▀░▀▀▀░▀▀▀░▀▀▀░░▀░░▀░▀░▀░▀░▀▀▀░░▀░
"""

REVERSED_PROB = 0.20
DEFAULT_MODEL_PROBABILITY = 0.80
FOLDER_PATH = "./output/"